# pandas 실습 노트북 3

## import하기

In [1]:
import pandas as pd
import numpy as np

## 중복 찾기 및 제거하기

In [2]:
fruit_list = [ ['apple', 500, 10],
                ['banana', 1000, 5],
                ['carrot', 200, 10],
                ['mango', 450, 30],
                ['apple', 500, 10],
              ]
df = pd.DataFrame(fruit_list, columns = ['name', 'price', 'quantity'])
df

     name  price  quantity
0   apple    500        10
1  banana   1000         5
2  carrot    200        10
3   mango    450        30
4   apple    500        10

In [3]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [4]:
np.sum(df.duplicated())

1

In [5]:
np.mean(df.duplicated())

0.2

In [6]:
df = df.drop_duplicates()
df

     name  price  quantity
0   apple    500        10
1  banana   1000         5
2  carrot    200        10
3   mango    450        30

## df.loc를 이용한 값의 추가

In [7]:
df.loc[4] = ['apple', 770, 33]
df

     name  price  quantity
0   apple    500        10
1  banana   1000         5
2  carrot    200        10
3   mango    450        30
4   apple    770        33

In [8]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

## 이름이 같은 경우 마지막만 남기기

In [9]:
df.duplicated('name')

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [10]:
np.sum(df.duplicated('name'))

1

In [11]:
df = df.drop_duplicates('name', keep='last')
df

     name  price  quantity
1  banana   1000         5
2  carrot    200        10
3   mango    450        30
4   apple    770        33

## NA값 제거하기

In [12]:
df.loc[5] = ['chicken', 9999, np.NaN ]
df

      name  price  quantity
1   banana   1000       5.0
2   carrot    200      10.0
3    mango    450      30.0
4    apple    770      33.0
5  chicken   9999       NaN

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 1 to 5
Data columns (total 3 columns):
name        5 non-null object
price       5 non-null int64
quantity    4 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [14]:
df.isnull()

    name  price  quantity
1  False  False     False
2  False  False     False
3  False  False     False
4  False  False     False
5  False  False      True

In [15]:
np.sum(df['price'].isnull())

0

In [16]:
np.sum(df['quantity'].isnull())

1

In [17]:
df['quantity2'] = df['quantity'].fillna(777)
df

      name  price  quantity  quantity2
1   banana   1000       5.0        5.0
2   carrot    200      10.0       10.0
3    mango    450      30.0       30.0
4    apple    770      33.0       33.0
5  chicken   9999       NaN      777.0

In [18]:
df['quantity'] = df['quantity'].fillna(777)
df

      name  price  quantity  quantity2
1   banana   1000       5.0        5.0
2   carrot    200      10.0       10.0
3    mango    450      30.0       30.0
4    apple    770      33.0       33.0
5  chicken   9999     777.0      777.0